Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade Property
 One or several analytical elements have become invalid during the upgrade process and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalElementsInvalidAfterUpgrade { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalElementsInvalidAfterUpgrade As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalElementsInvalidAfterUpgrade {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace